** Wrangling of traffic data in Vancouver and merging to Datablocks

In [1]:
import pandas as pd
import numpy as np

In [2]:
DBs = pd.read_csv('../../data/raw/DBs.csv')
DBs = DBs[['DBUID','CMANAME','DBPOP','lat','lon']]
DBs = DBs.rename(columns = {'DBUID':'id', 'CMANAME':'metropolitan_area', 'DBPOP':'pop'})

DBs

                 id metropolitan_area  pop      lat      lon
0       10010165001        St. John's  160  47.5300 -52.7765
1       10010165002        St. John's   25  47.5290 -52.7793
2       10010165006        St. John's  268  47.5265 -52.7768
3       10010165007        St. John's   53  47.5263 -52.7726
4       10010166001        St. John's   71  47.5268 -52.7730
...             ...               ...  ...      ...      ...
489671  62080028007               NaN  112  68.6235 -95.8734
489672  62080028008               NaN    0  68.6232 -95.8756
489673  62080028009               NaN   75  68.6230 -95.8369
489674  62080028010               NaN   47  68.6151 -95.8479
489675  62080028011               NaN   39  68.6204 -95.8743

[489676 rows x 5 columns]

In [3]:
DBsVan = DBs[DBs['metropolitan_area'] == 'Vancouver']
DBsVan = DBsVan.drop(columns=['metropolitan_area'])

DBsVan

                 id  pop      lat       lon
442430  59150004004   35  49.3739 -123.2738
442431  59150004005   50  49.3746 -123.2757
442432  59150004006   94  49.3738 -123.2763
442433  59150004011    0  49.3735 -123.2725
442434  59150004012    0  49.3725 -123.2729
...             ...  ...      ...       ...
457622  59154055002    0  49.0044 -122.4774
457623  59154055003    0  49.0036 -122.4762
457624  59154055004  386  49.0029 -122.4757
457625  59154055005    0  49.0062 -122.4772
457626  59154056001   85  49.0053 -122.4748

[15197 rows x 4 columns]

In [6]:
traffic_BC = pd.read_csv('../../data/raw/BC_trafic_data_2015_summary.csv')
traffic_BC.head()

,STAT,Sort Order,UTVS,SiteNo,TMP,Route,Description,Direction,LATITUDE,LONGITUDE,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,AADT,1.0,1.0,11-010N,11-010N,Rte 1,Route 1 From Tolmie Avenue (Victoria) To Mcken...,E,48.45658,-123.3835,...,NaN,NaN,18592.0,NaN,NaN,NaN,17020.0,NaN,NaN,21640.0
1,AADT,2.0,10.0,11-010S,11-010S,Rte 1,Route 1 From Mckenzie Avenue To Tolmie Avenue ...,W,48.45658,-123.3835,...,NaN,NaN,20192.0,NaN,NaN,NaN,19221.0,NaN,NaN,20713.0
2,AADT,3.0,2.0,P-11-1NS,P-11-1N,Rte 1,Route 1 From Mckenzie Avenue To Thetis I/C (Co...,E,48.46267,-123.4419,...,36604.0,37720.0,37504.0,38930.0,40781.0,40125.0,39746.0,NaN,NaN,41641.0
3,AADT,4.0,9.0,P-11-1NS,P-11-1S,Rte 1,Route 1 From Thetis I/C To Mckenzie Avenue,W,48.46267,-123.4419,...,37142.0,38214.0,37997.0,39327.0,40820.0,40044.0,39940.0,NaN,NaN,41675.0
4,AADT,5.0,3.0,P-11-7NS,P-11-7N,Rte 1,Route 1 From Thetis I/C To Millstream I/C (O/P...,E,48.46459,-123.4759,...,28036.0,29281.0,28918.0,30197.0,31395.0,31004.0,31501.0,NaN,NaN,33017.0

In [9]:
traffic_BC[['LATITUDE','LONGITUDE','2015']]

      LATITUDE  LONGITUDE     2015
0     48.45658  -123.3835  21640.0
1     48.45658  -123.3835  20713.0
2     48.46267  -123.4419  41641.0
3     48.46267  -123.4419  41675.0
4     48.46459  -123.4759  33017.0
...        ...        ...      ...
1265  54.51048  -126.2991      NaN
1266  49.02041  -118.2184   1365.0
1267  49.66843  -124.9891  15366.0
1268  49.95846  -125.2524   4977.0
1269  55.20543  -129.1434      NaN

[1270 rows x 3 columns]

In [8]:
DBsVan.to_csv('../../data/clean/vancouver_db.csv', index=False)